function [y_1,y_2] = testfun(a,b)
    c = a;
    a = MDH(a);  
    a1 = a(1:3);
    a2 = a(4:6);
    a3 = a(7:9);
    b1 = b(1:3);
    b2 = b(4:6);
    b3 = b(7:9);
    y1 = sqrt((a1(1) - b1(1))^2 + (a1(2) - b1(2))^2 + (a1(3) - b1(3))^2);
    y2 = sqrt((a2(1) - b2(1))^2 + (a2(2) - b2(2))^2 + (a2(3) - b2(3))^2);
    y3 = sqrt((a3(1) - b3(1))^2 + (a3(2) - b3(2))^2 + (a3(3) - b3(3))^2);
    y_1 = y1 + y2 + y3;
    y_2 = 0;
    for i = 1:6   % 计算关节角变化量之和
        y_3 = abs(c(i+6) - c(i)) + abs(c(i+12) - c(i+6));
        y_2 = y_2 + y_3;
    end
end